<template>
  <div id="Music">
    <aplayer :mutex="true" :audio="audio" :lrcType="1" :listMaxHeight="120" />
  </div>
</template>


<script>
export default {
  name: "Music",
  data() {
    return {
      audio: [
        {
          id: 0,
          name: "For River - Piano (Johnny's Version).mp3",
          artist: "Kan R. Gao",
          url: require("../../assets/music_0.mp3"),
          cover: require("../../assets/musicJpg_0.jpg"), // prettier-ignore
          lrc: "[00:00.00]纯音乐，请欣赏\n[00:01.10]暂无歌词\n[00:02.10] "
        },
        {
          id: 1,
          name: "secret base ~君がくれたもの~ ",
          artist: "茅野愛衣,戸松遥,早見沙織",
          url: require("../../assets/music_1.mp3"),
          cover: require("../../assets/musicJpg_1.jpg"), // prettier-ignore
          lrc: `[00:00.230]君と夏の終わり 将来の夢\n[00:04.170]大きな希望 忘れない\n[00:07.170]10年後の8月\n[00:09.700]また出会えるのを 信じて\n[00:14.360]最高の思い出を…\n[00:22.150]\n[00:39.960]出会いは ふっとした 瞬間 帰り道の交差点で\n[00:47.050]声をかけてくれたね 「一緒に帰ろう」\n[00:54.310]僕は 照れくさそうに カバンで顔を隠しながら\n[01:01.470]本当は とても とても 嬉しかったよ\n[01:07.240]\n[01:08.590]あぁ 花火が夜空 きれいに咲いて ちょっとセツナク\n[01:15.770]あぁ 風が時間とともに 流れる\n[01:21.840]\n[01:22.580]嬉しくって 楽しくって 冒険も いろいろしたね\n[01:29.760]二人の 秘密の 基地の中\n[01:36.120]\n[01:36.740]君と夏の終わり 将来の夢 大きな希望 忘れない\n[01:43.920]10年後の8月 また出会えるのを 信じて\n[01:51.010]君が最後まで 心から 「ありがとう」叫んでいたこと\n[01:56.930]知っていたよ\n[01:58.200]涙をこらえて 笑顔でさようなら せつないよね\n[02:05.420]最高の思い出を…\n[02:12.390]\n[02:13.070]あぁ 夏休みも あと少しで 終わっちゃうから\n[02:20.310]あぁ 太陽と月 仲良くして\n[02:26.400]\n[02:27.080]悲しくって 寂しくって 喧嘩も いろいろしたね\n[02:34.160]二人の 秘密の 基地の中\n[02:40.410]\n[02:41.140]君が最後まで 心から 「ありがとう」叫んでいたこと\n[02:47.000]知っていたよ\n[02:48.340]涙をこらえて 笑顔でさようなら せつないよね\n[02:55.630]最高の思い出を…\n[03:02.610]\n[03:03.320]突然の 転校で どうしようもなく\n[03:24.190]手紙 書くよ 電話もするよ 忘れないでね 僕のことを\n[03:31.420]いつまでも 二人の 基地の中\n[03:37.850]\n[03:38.520]君と夏の終わり ずっと話して\n[03:42.530]夕日を見てから星を眺め\n[03:45.670]君の頬を 流れた涙は ずっと忘れない\n[03:52.820]君が最後まで 大きく手を振ってくれたこと\n[03:58.540]きっと忘れない\n[03:59.930]だから こうして 夢の中で ずっと永遠に…\n[04:06.400]\n[04:07.110]君と夏の終わり 将来の夢 大きな希望 忘れない\n[04:14.270]10年後の8月 また出会えるのを 信じて\n[04:21.400]君が最後まで 心から 「ありがとう」叫んでいたこと\n[04:27.260]知っていたよ\n[04:28.640]涙をこらえて 笑顔でさようなら せつないよね\n[04:35.910]最高の思い出を…\n[04:42.450]\n[04:43.160]最高の思い出を…\n[04:53.010]\n`
        },
        {
          id: 2,
          name: "Seaside Vacation (《渚のバカンス》)",
          artist: "伊藤フウ",
          url: require("../../assets/music_2.mp3"),
          cover: require("../../assets/musicJpg_2.jpg"), // prettier-ignore
          lrc: `[00:04.17]青い風に揺られる渚で\n[00:11.13]あなたと二人\n[00:14.17]裸足で笑う夢を見たの\n[00:20.33]だけど不思議\n[00:24.15]どうして？\n[00:25.89]いますぐ会いに行きたい\n[00:30.10]ドキドキいつもより\n[00:34.11]感じちゃってる\n[00:36.26]ねえお願い\n[00:38.28]あなたのいちばん特別にして\n[00:45.19]そして教えて\n[00:48.86]手の繋ぎ方から\n[00:52.96]波のドレスのマーメイド\n[00:58.34]連れ出して\n[01:00.77]きらめく橋の向こうまで\n[01:08.79]貝殻繋いだメモリアル\n[01:14.42]抱きしめて\n[01:16.85]白い浜辺で待ってるわ\n[01:23.80]uh yeah\n[01:25.83]lalala\n[01:32.32]深い空に流した秘密の\n[01:39.24]ボトルメールは\n[01:42.27]遥かなさざ波に混じってく\n[01:48.11]だけどどうか\n[01:52.19]届いて\n[01:53.94]輝く海を飛び越え\n[01:58.28]わたしたちを繋ぐ\n[02:02.12]愛のメロディ\n[02:04.20]ねえ不思議ね\n[02:06.37]どれだけ砕けても消えない想い\n[02:13.06]「会いたい」それだけで\n[02:16.81]また前を向けるわ\n[02:20.80]水底埋めたシーグラス\n[02:26.36]見つけたら\n[02:28.92]拾って胸に持っていて\n[02:36.97]波間に託すメッセージ\n[02:42.50]受け取って\n[02:44.97]きっと辿り着けるはずよ\n[02:51.71]uh yeah\n[02:53.61]lalala\n[02:57.08]\n[03:20.44]ねえ聞こえる？\n[03:22.30]いくつも繋いで重なった星の\n[03:29.22]波が溢れて微かに潮騒を\n[03:36.36]鳴らして呼んでる\n[03:39.46]だからもう\n[03:43.77]奇跡待たなくてもいいの\n[03:48.76]飛び込んで　会いに来て\n[03:56.91]渚の果て　何度でも\n[04:02.50]歌うから\n[04:04.83]いつか想いが叶うまで\n[04:13.04]波の翼のマーメイド\n[04:18.48]連れてって\n[04:21.05]きらめく橋の向こうまで\n[04:27.74]uh yeah\n[04:29.93]一緒に\n[04:32.97]\n`
        },
        {
          id: 3,
          name: "回梦游仙",
          artist: "骆集益",
          url: require("../../assets/music_3.mp3"),
          cover: require("../../assets/musicJpg_3.jpg"), // prettier-ignore
          lrc: "[00:00.00]纯音乐，请欣赏\n[00:01.10]暂无歌词\n[00:02.10] "
        },
        {
          id: 4,
          name: "and I'm home",
          artist: "喜多村英梨,野中藍 ",
          url: require("../../assets/music_4.mp3"),
          cover: require("../../assets/musicJpg_4.jpg"), // prettier-ignore
          lrc:
            "[00:00.000] 作词 : wowaka\n[00:01.000] 作曲 : wowaka\n[00:02.000] 编曲 : wowaka/とく\n[00:16.000]锖付いた心、音も无い世界\n[00:21.000]何を见てるの\n[00:24.000]またねを言える颜を探すよ\n[00:29.000]それを缲り返すだけ\n[00:31.000]気付けばそこには\n[00:34.000]一人っきりで泣く後ろ姿\n[00:38.000]辛いような\n[00:40.000]寂しいような\n[00:42.000]場所\n[00:43.000]手を繋いでいたいんだ\n[00:48.000]何度目の気持ちだろう\n[00:51.000]ここにある温もりは\n[00:55.000]間違いでも構わない\n[00:59.000]傍にいること\n[01:03.000]涙の音 ため息の色\n[01:07.000]今、確かめる现在地\n[01:11.000]冗談みたいな毎日\n[01:15.000]見たい　見たい\n[01:17.000]未来\n[01:21.000]強がりの声も掠れたな\n[01:26.000]と夢に落ちるの\n[01:30.000]抱えた膝\n[01:31.000]目を落とすと\n[01:33.000]すぐに崩れてしまいそうで\n[01:36.000]このまま、このまま\n[01:40.000]二人きり駆け込む远い出口\n[01:44.000]まだ 期待しているの\n[01:48.000]さぁ 笑って见つめ合うんだ\n[01:53.000]単纯で无邪気な颜\n[01:56.000]くしゃくしゃの思い抱いて\n[02:00.000]迷い込んだ場所さえ優しすぎて\n[02:08.000]何度でも名前を呼ぶよ\n[02:12.000]不確かな未来でも\n[02:16.000]离せないもの 思うだけ心が痛いよ\n[02:23.000]ここにいるよ\n[02:25.000]ここにいるよ\n[02:27.000]帰る场所はここだよ\n[02:32.000]いつだって変わらない思いを残すの\n"
        }
      ]
    }
  },
  mounted() {
    //自动改变主题颜色
    // const link = document.createElement("script")
    // link.type = "text/javascript"
    // link.src = "https://cdn.jsdelivr.net/npm/colorthief@2.0.2/dist/color-thief.min.js"
    // document.body.appendChild(link)
  }
}
</script>

<style lang="less" scoped>
.aplayer {
  top: 288px;
  width: 45%;
  border-radius: 10px;
  box-shadow: inset 0px -5px 30px 10px rgba(0, 0, 0, 0.15);
  opacity: 0.9;
}
</style>
